import {Event} from './Event';

//==========================================================
// <T>鼠标离开事件信息类。</T>
//
// @author maocy
// @version 160403
//==========================================================
export class MouseLeaveEvent extends Event {

   //==========================================================
   // <T>构造处理。</T>
   //==========================================================
   public constructor() {
      super();
      // 设置属性
      this.handle = 'mouseleave';
   }

   //==========================================================
   // <T>接收事件信息。</T>
   //
   // @param hEvent 页面事件
   //==========================================================
   public attachEvent(hEvent) {
   }
}
