//==========================================================
// <T>关联资源接口。</T>
//
// @console
// @author maocy
// @version 150325
//==========================================================
export class MLinkerResource {
   //o = MO.Class.inherits(this, o);
   //..........................................................
   // @attribute
   //o._resource      = MO.Class.register(o, new MO.AGetSet('_resource'));
   //..........................................................

   //==========================================================
   // <T>加载资源。</T>
   //
   // @method
   // @param resource:FResource 资源
   //==========================================================
   public loadResource(resource) {
      //this._resource = resource;
   }

   //==========================================================
   // <T>加载资源。</T>
   //
   // @method
   // @param resource:FResource 资源
   //==========================================================
   public reloadResource() {
      //var o = this;
      //o.loadResource(o._resource);
   }

   //==========================================================
   // <T>释放处理。</T>
   //
   // @method
   //==========================================================
   public dispose() {
      //var o = this;
      // o._resource = null;
   }
}
